Catalogs/Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Товары</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВместимостьУпаковки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Крепкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИКПУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяСкидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бренд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccumulationRegisters/Остатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Остатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Примечания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порожняя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бронь</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ЦеныТоваров</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ИсторияРеквизитов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УчетныеПолитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>УчетныеПолитики</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Бухгалтер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаСписания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаценкаПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СкидкиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>СкидкиТоваров</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыТовара</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТараПродажная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТараВозвратная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Товары/Forms/ФормаПодбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Дата") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Дата", Параметры.Дата);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Дата", ТекущаяДата());
	КонецЕсли;
	
	Если Параметры.Свойство("Склад") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Склад", Параметры.Склад);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Склад", Справочники.Склады.ПустаяСсылка());
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Организация", Параметры.Организация);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Организация", ПараметрыСеанса.Пользователь.Организация);
	КонецЕсли;
	
	Если Параметры.Свойство("Контрагент") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Контрагент", Параметры.Контрагент);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	КонецЕсли;
	
	//Если Параметры.Свойство("Заказ") Тогда
	//	Список.Параметры.УстановитьЗначениеПараметра("Заказ", Параметры.Заказ);
	//Иначе
	//	Список.Параметры.УстановитьЗначениеПараметра("Заказ", Ложь);
	//КонецЕсли;
	
    Если Параметры.Свойство("ТекущаяСтрока") И ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
		Если ТипЗнч(Параметры.ТекущаяСтрока) = Тип("СправочникСсылка.Товары") Тогда
			СтрокаПоиска = Параметры.ТекущаяСтрока;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("СтрокаПоиска") И ЗначениеЗаполнено(Параметры.СтрокаПоиска) Тогда
		СтрокаПоиска = Параметры.СтрокаПоиска;
	КонецЕсли;
	
	Если ПустаяСтрока(СтрокаПоиска) = Ложь Тогда
		ФильтрТоваровНаСервере(СтрокаПоиска);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	 РезультатСсылка = ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ФильтрТоваров(Текст);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрТоваров(ЗНАЧ Подстрока)
	ФильтрТоваровНаСервере(Подстрока);
	
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ФильтрТоваровНаСервере(ЗНАЧ Текст)
	Подстрока = ОтформатироватьПодстроку(Текст);
	
	Подстроки = ПолучитьПодстрокиПоиска(Подстрока, ЭтаФорма.Паразиты);
    
	Список.Параметры.УстановитьЗначениеПараметра("Подстрока", Подстрока);
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	Товары.*,
	|
	|	ЕСТЬNULL(РегСтавкаНДС.Значение, ЕСТЬNULL(РегУчетнаяПолитика.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС))) КАК СтавкаНДС,
	|
	|	ЕСТЬNULL(РегОстатки.КоличествоОстаток, 0) КАК Остаток,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РегОстатки.КоличествоОстаток, 0) <> 0 И ЕСТЬNULL(РегОстатки.СуммаОстаток, 0) <> 0 ТОГДА
	|			ВЫБОР
	|				КОГДА (РегОстатки.СуммаОстаток / РегОстатки.КоличествоОстаток) > 0 ТОГДА
	|					(РегОстатки.СуммаОстаток / РегОстатки.КоличествоОстаток)
	|				ИНАЧЕ
	|					ЕСТЬNULL(РегЦенаПоследняя.Цена, ЕСТЬNULL(РегЦенаСледующая.Цена, 0))
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ЕСТЬNULL(РегЦенаСледующая.Цена, ЕСТЬNULL(РегЦенаПоследняя.Цена, 0))
	|	КОНЕЦ КАК ЦенаБазовая,
	|	
	|	ЕСТЬNULL(РегЦенаСледующая.Цена, 0) КАК ЦенаСледующая,
	|
	|	ЕСТЬNULL(РегЦенаПродажная.Цена, 0) КАК ЦенаПродажная,
	|
	|	РегСкидкиТоваров.Скидка КАК Скидка
	|	
	|ИЗ
	|	Справочник.Товары КАК Товары
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Остатки.Остатки(&Дата, Склад В ИЕРАРХИИ (&Склад) И Порожняя = Ложь) КАК РегОстатки ПО (РегОстатки.Товар = Товары.Ссылка)
	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныТоваров.СрезПоследних(&Дата, Тип = ""ЦенаБазовая"") КАК РегЦенаПоследняя ПО (РегЦенаПоследняя.Товар = Товары.Ссылка)
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныТоваров.СрезПервых(&Дата, Тип = ""ЦенаБазовая"") КАК РегЦенаСледующая ПО (РегЦенаСледующая.Товар = Товары.Ссылка)
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныТоваров.СрезПоследних(&Дата, Тип = ""ЦенаПродажная"") КАК РегЦенаПродажная ПО РегЦенаПродажная.Товар = Товары.Ссылка
	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРеквизитов.СрезПоследних(&Дата, Реквизит = ""СтавкаНДС"") КАК РегСтавкаНДС ПО (РегСтавкаНДС.Ссылка = Товары.Ссылка)
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетныеПолитики.СрезПоследних(&Дата, Организация = &Организация) КАК РегУчетнаяПолитика ПО (РегУчетнаяПолитика.СтавкаНДС.Ставка > 0)
	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СкидкиТоваров.СрезПоследних(&Дата, Контрагент = &Контрагент ИЛИ Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК РегСкидкиТоваров ПО (РегСкидкиТоваров.Товар = Товары.Ссылка)
	|ГДЕ
	|	Товары.ЭтоГруппа = ЛОЖЬ И Товары.ВидТовара.ТипТовара = ЗНАЧЕНИЕ(Перечисление.ТипыТовара.Товар) И ((Товары.Наименование ПОДОБНО ""%" + Подстрока + "%"")";
	
	Для Каждого Поле Из Метаданные.Справочники.Товары.ВводПоСтроке Цикл
		ТекстЗапроса = ТекстЗапроса + " ИЛИ (Товары." + Поле.Имя + " ПОДОБНО ""%" + Подстрока + "%"")";
	КонецЦикла;
	
	Если Подстроки.Количество() > 0 Тогда
		ТекстЗапроса = ТекстЗапроса + " ИЛИ (ИСТИНА ";
	КонецЕсли;
	
	Для Каждого Подстрока Из Подстроки Цикл
		ТекстЗапроса = ТекстЗапроса + " И (Товары.Наименование ПОДОБНО ""%" + Подстрока + "%"" ИЛИ Товары.ПолноеНаименование ПОДОБНО ""%" + Подстрока + "%"")";
	КонецЦикла;
	
	Если Подстроки.Количество() > 0 Тогда
		ТекстЗапроса = ТекстЗапроса + ")";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ")";
	
	Список.ПроизвольныйЗапрос = Истина;
	Список.ТекстЗапроса = ТекстЗапроса;
	
	СтрокаПоиска = Текст;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПодстрокиПоиска(ЗНАЧ Текст, Паразиты)
	
	Результат = Новый Массив;
	
	Если Паразиты.Количество() = 0 Тогда
		Паразиты.Добавить("гр");
		Паразиты.Добавить("gr");
		Паразиты.Добавить("мл");
		Паразиты.Добавить("ml");
		Паразиты.Добавить("по");
		Паразиты.Добавить("шт");
		Паразиты.Добавить("со");
		
		Паразиты.Добавить("кор");
		Паразиты.Добавить("упак");
		Паразиты.Добавить("штук");
		Паразиты.Добавить("упаков");
		Паразиты.Добавить("вкусом");
	КонецЕсли;
	
	Подстроки = СтрРазделить(Текст, " ", Ложь);
	Для Каждого Подстрока Из Подстроки Цикл
		Если СтрДлина(Подстрока) >= 2 И Паразиты.НайтиПоЗначению(Подстрока) = Неопределено Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

&НаСервереБезКонтекста
Функция ОтформатироватьПодстроку(Знач Текст)
	
	Подстрока = СокрЛП(Текст);
	Подстрока = СтрЗаменить(Подстрока, "¶", " ");
	Подстрока = СтрЗаменить(Подстрока, ".", " ");
	Подстрока = СтрЗаменить(Подстрока, ",", " ");
	Подстрока = СтрЗаменить(Подстрока, ",", " ");
	Подстрока = СтрЗаменить(Подстрока, "-", " ");
	Подстрока = СтрЗаменить(Подстрока, "+", " ");
	Подстрока = СтрЗаменить(Подстрока, "(", " ");
	Подстрока = СтрЗаменить(Подстрока, ")", " ");
	Подстрока = СтрЗаменить(Подстрока, """", " ");
	Подстрока = СтрЗаменить(Подстрока, "«", " ");
	Подстрока = СтрЗаменить(Подстрока, "»", " ");
	Подстрока = СтрЗаменить(Подстрока, "*", " ");
	Подстрока = СтрЗаменитьПоРегулярномуВыражению(Подстрока, "[^\w\d\s\.]", " ");
	
	Пока СтрЧислоВхождений(Подстрока, "  ") > 0 Цикл
		Подстрока = СтрЗаменить(Подстрока, "  ", " ");
	КонецЦикла;
	
	Подстрока = СокрЛП(Подстрока);
	
	Возврат Подстрока;

КонецФункции
